app/controllers/boms_controller.rb

SELECT * FROM `boms`
---
  def index
    @boms = Bom.all

SELECT * FROM `boms` WHERE (`boms`.`id` = 1)
---
  def show
    @bom = Bom.find(params[:id])

SELECT * FROM `boms` WHERE (`boms`.`id` = 1)
---
  def edit
    @bom = Bom.find(params[:id])