app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT * FROM `items`

  def new
    @bom = Bom.find(params[:bom_id])
---
SELECT * FROM `boms` WHERE (`boms`.`id` = 1)

  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`name`, `created_at`, `main_image_content_type`, `quantity`, `notes`, `updated_at`, `main_image_updated_at`, `main_image_file_name`, `main_image_file_size`, `bom_id`, `info_url`, `item_type`, `item_image_file_name`) VALUES('test', '2009-04-08 05:57:26', NULL, NULL, NULL, '2009-04-08 05:57:26', NULL, NULL, NULL, NULL, NULL, NULL, NULL)

  def destroy
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)
DELETE FROM `items` WHERE `id` = 1