app/controllers/projects_controller.rb

SELECT * FROM `projects`
SELECT * FROM `projects` LIMIT 0, 5
SELECT count(*) AS count_all FROM `projects`
---
  def index
    @projects = Project.all
    @projects = Project.paginate :page=>params[:page],  :per_page => 15

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `boms` WHERE (`boms`.`project_id` = 1) LIMIT 1
---
  def show
    tab :project
    @context_menu = "project_show"
    @project = Project.find(params[:id])
    @bom = Bom.find(:first, :conditions => { :project_id=>@project.id})

INSERT INTO `boms` (`name`, `created_at`, `project_id`, `updated_at`) VALUES('NutJob', '2009-04-08 03:11:46', NULL, '2009-04-08 03:11:46')
INSERT INTO `projects` (`name`, `project_subtype`, `unptntnumber`, `created_at`, `main_image_content_type`, `project_type`, `updated_at`, `main_image_updated_at`, `main_image_file_name`, `main_image_file_size`, `license_id`, `description`, `project_image_file_name`, `status`, `owner`) VALUES('NutJob', NULL, NULL, '2009-04-08 02:45:08', 'image/jpeg', NULL, '2009-04-08 02:45:08', '2009-04-08 02:45:08', 'newwrap.jpg', 123527, NULL, 'test', NULL, NULL, NULL)
UPDATE `boms` SET `updated_at` = '2009-04-08 03:11:46', `project_id` = 1 WHERE `id` = 1
---
  def create
    @project = Project.new(params[:project])

    #create bill of materials
    bom = Bom.create(:name => @project.name)
    bom.save